project02/app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-01-28 05:55:11', 2, 2, 1, 59.9, '2011-01-28 05:55:11')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('sdfsdf', 'lkjkljlkjl ljkjkl', '2011-01-28 05:55:11', '2011-01-28 05:55:11', 'cc', 'kjlkjlljljk')
---
	def save_order
		@cart = find_cart
		@order = Order.new(params[:order])
		@order.add_line_items_from_cart(@cart)
		if @order.save