project02/app/controllers/users_controller.rb

	def destroy
		@user = User.find(params[:id])
		begin
			@user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
DELETE FROM "users" WHERE "id" = 1