project04/app/controllers/articles_controller.rb

SELECT * FROM "articles"
SELECT count(*) AS count_all FROM "articles"
---
  def index
    @articles = Article.all
    @total_articles = Article.count

INSERT INTO "articles" ("created_at", "title", "author_name", "body", "creation_date", "updated_at") VALUES('2011-02-02 18:34:47', 'Another test', 'tester', 'fgdgdfgdfgdfgertert', NULL, '2011-02-02 18:34:47')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-02-02 18:35:09', "body" = 'This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a a test.' WHERE "id" = 1
---
  def update
    @article = Article.find(params[:id])
    @article.edits += 1

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE ("articles"."id" = 5)
DELETE FROM "articles" WHERE "id" = 5
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy