project05/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM "articles" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "articles"

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author_name", "body", "creation_date", "updated_at") VALUES('2011-02-02 18:34:47', 'Another test', 'tester', 'fgdgdfgdfgdfgertert', NULL, '2011-02-02 18:34:47')

  def update
    @article = Article.find(params[:id])
    @article.edits += 1

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-02-02 18:35:09', "body" = 'This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a test.This is a a test.' WHERE "id" = 1